# Lab 08 - Data Mining - Benjamin Bui-Dang
- For every output that adds new knowledge, you need to provide your observations.

## Steps:
1. Context (Background), project objectives (questions that are asked), Data Descriptions (Explanation for every column's name)
2. Importing libraries
3. Reading (Loading) the Dataset
4. EDA | Exploratory Data Analysis (Univariate, Bivariate, and multivariate)
   - BDE (Basic Data Exploration): data attribute, head/tail, info, describe, isnull
   - Data Cleaning (Missing values, Outliers)
   - Data merging and grouping
   - Data Visualization
   - EDA Summary
5. Conclusion

What is data wrangling? Preparing data for model-building process. Data wrangling involves "feature transformation".

What is a feature transformation? It is converting the data types of each variable. For example, from str dtype to int dtype.

## Step 1:

### Context:
To examine the movies with the ratigs for each movie and the users who rated the movies.

### Objectives:
1. What are the top 20 movies with the highest ratings?
2. For each genre, how many movies do we have in this project?
3. What are the movies with more than one genre?
4. what is the relationship between the movies genres and the user's genders?

### Data Description: (You need to complete this part for all 3 datasets)

#### User Data set:
This dataset involves the information surrounding the audiences of the movies. This includes the age, the occupation, and the gender, and the occupation.  
#### Ratings Data set:
This dataset involves the information surrounding the ratings of movies based on the movie's ID's. 
#### Movie Data set: 
This dataset involves the information surrounding the all the movies with the genre or genres of each one.

## Step 2: Importing Libraries

In [1]:
!pip install seaborn

Requirement already satisfied: seaborn in c:\anaconda\lib\site-packages (0.11.2)
Requirement already satisfied: pandas>=0.23 in c:\anaconda\lib\site-packages (from seaborn) (1.4.2)
Requirement already satisfied: scipy>=1.0 in c:\anaconda\lib\site-packages (from seaborn) (1.7.3)
Requirement already satisfied: matplotlib>=2.2 in c:\anaconda\lib\site-packages (from seaborn) (3.5.1)
Requirement already satisfied: numpy>=1.15 in c:\anaconda\lib\site-packages (from seaborn) (1.21.5)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.2)
Requirement already satisfied: pillow>=6.2.0 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (9.0.1)
Requirement already satisfied: pyparsing>=2.2.1 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: fonttools>=4.22.0 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: packaging>=20.0 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: python-dateutil>=2.7 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: cycler>=0.10 in c:\anaconda\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: pytz>=2020.1 in c:\anaconda\lib\site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in c:\anaconda\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)

In [2]:
# general libraries
import numpy as np
import pandas as pd
import math

# data visualization libraries
import matplotlib.pyplot as plt
import seaborn as sns

# supressing any warning
import warnings
warnings.filterwarnings('ignore')

## Step 3: Loading Dataset

In [3]:
# let's load the datasets
df = pd.read_csv('movie.csv')
df1 = pd.read_csv('ratings.csv')
df2 = pd.read_csv('user.csv')

## Step 4: EDA

### Basic Data Exploration (BDE)¶

In [4]:
movie = df.copy()
ratings = df1.copy()
user = df2.copy()

In [5]:
movie.head()

,movie id,movie title,release date,Action,Adventure,Animation,Childrens,Comedy,Crime,Documentary,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story,1-Jan-95,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye,1-Jan-95,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms,1-Jan-95,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty,1-Jan-95,1,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat,1-Jan-95,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0

In [6]:
movie.tail()

,movie id,movie title,release date,Action,Adventure,Animation,Childrens,Comedy,Crime,Documentary,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
1675,1678,Mat' i syn,6-Feb-98,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1676,1679,B. Monkey,6-Feb-98,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,0
1677,1680,Sliding Doors,1-Jan-98,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
1678,1681,You So Crazy,1-Jan-94,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1679,1682,Scream of Stone (Schrei aus Stein),8-Mar-96,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

**Observations**
1. There are 1680 entries in this dataset. 
2. There are 21 Columns in this dataset.
3. There are 18 different movie genres.
4. There are some movies with more than one genre.
5. There are some movies with no genres.

In [7]:
ratings.head()

   user id  movie id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [8]:
ratings.tail()

       user id  movie id  rating  timestamp
99995      880       476       3  880175444
99996      716       204       5  879795543
99997      276      1090       1  874795795
99998       13       225       2  882399156
99999       12       203       3  879959583

# **Observations**
1. There are 100,000 entrries in this dataset. 
2. There are four columns on this dataset. 
3. There exists two different ID's used in theis dataset, the User ID and the Movie ID.

In [9]:
user.head()

   user id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [10]:
user.tail()

     user id  age gender     occupation zip code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

**Observations**
1. There are a total of 943 entries in this dataset.
2. There are five columns in this dataset.
3. Ranked by user ID.

### Data Attributes

In [11]:
movie.shape

(1680, 21)

In [12]:
movie.size

35280

In [13]:
movie.ndim

2

In [14]:
movie.columns

Index(['movie id', 'movie title', 'release date', 'Action', 'Adventure',
       'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance',
       'Sci-Fi', 'Thriller', 'War', 'Western'],
      dtype='object')

In [15]:
movie.dtypes

movie id         int64
movie title     object
release date    object
Action           int64
Adventure        int64
Animation        int64
Childrens        int64
Comedy           int64
Crime            int64
Documentary      int64
Drama            int64
Fantasy          int64
Film-Noir        int64
Horror           int64
Musical          int64
Mystery          int64
Romance          int64
Sci-Fi           int64
Thriller         int64
War              int64
Western          int64
dtype: object

**Observations**
1. There are 1680 Entries and 21 columns in this dataset.
2. This dataset is two dminesional.
3. There are 35,280 different values associated in this dataset.
4. All datatypes are integer datatypes except for movie title and release date which are objects. 
5. There are 18 genres.

In [16]:
ratings.size

400000

In [17]:
ratings.shape

(100000, 4)

In [18]:
ratings.ndim

2

In [19]:
ratings.columns

Index(['user id', 'movie id', 'rating', 'timestamp'], dtype='object')

In [20]:
ratings.dtypes

user id      int64
movie id     int64
rating       int64
timestamp    int64
dtype: object

**Observations**
1. There are a total of 400000 values associated in this dataset.
2. There are 100000 entries and four columns in this dataset.
3. This dataset is two dimensional.
4. All rating data types are integers.

In [21]:
user.size

4715

In [22]:
user.shape

(943, 5)

In [23]:
user.ndim

2

In [24]:
user.columns

Index(['user id', 'age', 'gender', 'occupation', 'zip code'], dtype='object')

In [25]:
user.dtypes

user id        int64
age            int64
gender        object
occupation    object
zip code      object
dtype: object

**Observations**
1. The total amount of values associated in this dataset is 4715.
2. There are 943 entries and five columns in this dataset. 
3. There exists two dimensions in this dataset.
4. Only User ID and Age are data typed as integers.
5. User columns include the age, gender, occupation, and zipcode.

In [26]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1680 entries, 0 to 1679
Data columns (total 21 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   movie id      1680 non-null   int64
 1   movie title   1680 non-null   object
 2   release date  1680 non-null   object
 3   Action        1680 non-null   int64
 4   Adventure     1680 non-null   int64
 5   Animation     1680 non-null   int64
 6   Childrens     1680 non-null   int64
 7   Comedy        1680 non-null   int64
 8   Crime         1680 non-null   int64
 9   Documentary   1680 non-null   int64
 10  Drama         1680 non-null   int64
 11  Fantasy       1680 non-null   int64
 12  Film-Noir     1680 non-null   int64
 13  Horror        1680 non-null   int64
 14  Musical       1680 non-null   int64
 15  Mystery       1680 non-null   int64
 16  Romance       1680 non-null   int64
 17  Sci-Fi        1680 non-null   int64
 18  Thriller      1680 non-null   int64
 19  War           1680 non-null   int64
 20  Western       1680 non-null   int64
dtypes: int64(19), object(2)
memory usage: 275.8+ KB

**Observations**
1. There are 1680 entries.
2. There are 21 columns.
3. Nineteen of the 21 columns are data typed integers.
4. Two of the the 21 columns are data typed objects.
5. There are no missing values in any of the columns.

In [47]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user id    100000 non-null  int64
 1   movie id   100000 non-null  int64
 2   rating     100000 non-null  int64
 3   timestamp  100000 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

**Observations**
1. There are 100000 entries.
2. There are four columns.
3. All datatypes are integers
4. No missing values.

In [28]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

**Observations**
1. There are 943 entries.
2. There are five columns.
3. No missing values in any of the columns
4. Two integer datatypes.
5. Three object datatypes.

In [29]:
movie.isnull().sum()

movie id        0
movie title     0
release date    0
Action          0
Adventure       0
Animation       0
Childrens       0
Comedy          0
Crime           0
Documentary     0
Drama           0
Fantasy         0
Film-Noir       0
Horror          0
Musical         0
Mystery         0
Romance         0
Sci-Fi          0
Thriller        0
War             0
Western         0
dtype: int64

In [30]:
ratings.isnull().sum()

user id      0
movie id     0
rating       0
timestamp    0
dtype: int64

In [31]:
user.isnull().sum()

user id       0
age           0
gender        0
occupation    0
zip code      0
dtype: int64

**Observations**
1. There are no missing values throughout the datasets. 
2. In user dataset there are no missing values. 
3. In Ratings dataset there are no missing values.
4. In Movie dataset there are no missing values

In [32]:
movie.describe().T

,count,mean,std,min,25%,50%,75%,max
movie id,1680.0,841.525595,485.609591,1.0,421.75,841.5,1261.25,1682.0
Action,1680.0,0.149405,0.356593,0.0,0.00,0.0,0.00,1.0
Adventure,1680.0,0.080357,0.271926,0.0,0.00,0.0,0.00,1.0
Animation,1680.0,0.025000,0.156171,0.0,0.00,0.0,0.00,1.0
Childrens,1680.0,0.072619,0.259587,0.0,0.00,0.0,0.00,1.0
Comedy,1680.0,0.300595,0.458653,0.0,0.00,0.0,1.00,1.0
Crime,1680.0,0.064881,0.246389,0.0,0.00,0.0,0.00,1.0
Documentary,1680.0,0.029762,0.169980,0.0,0.00,0.0,0.00,1.0
Drama,1680.0,0.431548,0.495440,0.0,0.00,0.0,1.00,1.0
Fantasy,1680.0,0.013095,0.113717,0.0,0.00,0.0,0.00,1.0
Film-Noir,1680.0,0.014286,0.118701,0.0,0.00,0.0,0.00,1.0
Horror,1680.0,0.054762,0.227583,0.0,0.00,0.0,0.00,1.0
Musical,1680.0,0.033333,0.179559,0.0,0.00,0.0,0.00,1.0
Mystery,1680.0,0.036310,0.187115,0.0,0.00,0.0,0.00,1.0
Romance,1680.0,0.147024,0.354235,0.0,0.00,0.0,0.00,1.0
Sci-Fi,1680.0,0.060119,0.237778,0.0,0.00,0.0,0.00,1.0
Thriller,1680.0,0.149405,0.356593,0.0,0.00,0.0,0.00,1.0
War,1680.0,0.042262,0.201246,0.0,0.00,0.0,0.00,1.0
Western,1680.0,0.016071,0.125788,0.0,0.00,0.0,0.00,1.0

**Observations**
1. The maximum number of entries is 1682.
2. Drama has the highest average with 0.43.
3. Fantasy has the lowest average with 0.013.

In [33]:
ratings.describe()

            user id       movie id         rating     timestamp
count  100000.00000  100000.000000  100000.000000  1.000000e+05
mean      462.48475     425.530130       3.529860  8.835289e+08
std       266.61442     330.798356       1.125674  5.343856e+06
min         1.00000       1.000000       1.000000  8.747247e+08
25%       254.00000     175.000000       3.000000  8.794487e+08
50%       447.00000     322.000000       4.000000  8.828269e+08
75%       682.00000     631.000000       4.000000  8.882600e+08
max       943.00000    1682.000000       5.000000  8.932866e+08

**Observations**
1. The average rating was 3.53.
2. The lowest rating was 1
3. The highest rating was 5.
4. The median rating was four.

In [34]:
user.describe()

          user id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

**Observations**
1. There are a total of 943 entries.
2. The average age is 34. 
3. The median age is 31.
4. The oldest age is 73.
5. The youngest age is seven.

## Mining Questions¶

### 1. How many movies per each genre?¶

In [35]:
movie[['Action', 'Adventure',
       'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance',
       'Sci-Fi', 'Thriller', 'War', 'Western']].sum()

Action         251
Adventure      135
Animation       42
Childrens      122
Comedy         505
Crime          109
Documentary     50
Drama          725
Fantasy         22
Film-Noir       24
Horror          92
Musical         56
Mystery         61
Romance        247
Sci-Fi         101
Thriller       251
War             71
Western         27
dtype: int64

**Observations**
1. The genre with the most amount of movies associated with it is Drama.
2. The genre with the least amount of movies associated with it is Fantasy. 
3. There are a total of 18 different genres

In [36]:
movie.loc[:,'Action':'Western'].sum()

Action         251
Adventure      135
Animation       42
Childrens      122
Comedy         505
Crime          109
Documentary     50
Drama          725
Fantasy         22
Film-Noir       24
Horror          92
Musical         56
Mystery         61
Romance        247
Sci-Fi         101
Thriller       251
War             71
Western         27
dtype: int64

In [37]:
movie.loc[:,'Action':'Western'].sum().sort_values()

Fantasy         22
Film-Noir       24
Western         27
Animation       42
Documentary     50
Musical         56
Mystery         61
War             71
Horror          92
Sci-Fi         101
Crime          109
Childrens      122
Adventure      135
Romance        247
Thriller       251
Action         251
Comedy         505
Drama          725
dtype: int64

In [38]:
movie.loc[:,'Action':'Western'].sum().sort_values(ascending=False)

Drama          725
Comedy         505
Action         251
Thriller       251
Romance        247
Adventure      135
Childrens      122
Crime          109
Sci-Fi         101
Horror          92
War             71
Mystery         61
Musical         56
Documentary     50
Animation       42
Western         27
Film-Noir       24
Fantasy         22
dtype: int64

**Observations**
1. The genre with the least amount of movies associated with it is fantasy.
2. The genre with the least amount of movies associated with it is Drama.
3. The top five genres with the most movies are Drama, Comedy, Action, Thriller, and Romance. 
4. The top five genres with the least amount of movies are Fantasy, Film-Noir, Western, Animation, and Documentary.

In [39]:
genre = movie.loc[:,'Action':'Western'].sum().sort_values(ascending=False)

### 2. What are the top five genres?¶

In [40]:
genre.head()

Drama       725
Comedy      505
Action      251
Thriller    251
Romance     247
dtype: int64

In [41]:
len(genre)

18

**Observations**
1. Drama is at the top with 725 movies.
2. Romance is at the bottom five with 247 movies. 
3. There are two genres that have the same value and they are 251. 
4. The amount oof genres is 18.

### 3. What are the movies with more than one genre? (number of genre per movie)

In [42]:
# 1. Creating a new dataset based on movie id and movie title 
genre_movie = movie[['movie id','movie title']]
genre_movie

      movie id                          movie title
0            1                           Toy Story
1            2                           GoldenEye
2            3                          Four Rooms
3            4                          Get Shorty
4            5                             Copycat
...        ...                                  ...
1675      1678                          Mat' i syn
1676      1679                           B. Monkey
1677      1680                       Sliding Doors
1678      1681                        You So Crazy
1679      1682  Scream of Stone (Schrei aus Stein)

[1680 rows x 2 columns]

In [43]:
type(genre_movie)

pandas.core.frame.DataFrame

In [44]:
# 2. adding a new column to this dataset
# and we name it "num of genres"

genre_movie['num of genres'] = movie.loc[:, 'Action':'Western'].sum(axis=1)
genre_movie

      movie id                          movie title  num of genres
0            1                           Toy Story               3
1            2                           GoldenEye               3
2            3                          Four Rooms               1
3            4                          Get Shorty               3
4            5                             Copycat               3
...        ...                                  ...            ...
1675      1678                          Mat' i syn               1
1676      1679                           B. Monkey               2
1677      1680                       Sliding Doors               2
1678      1681                        You So Crazy               1
1679      1682  Scream of Stone (Schrei aus Stein)               1

[1680 rows x 3 columns]

**Observations**
1. There are 1680 entries.
2. The top five movies that are shown have a majority of three genres, with Four Rooms having only one genre. 
3. The bottom five movies that are shown have a majority of 1 genre with B. Monkey and Sliding Doors having two genres.

In [45]:
genre_movie['num of genres'].value_counts()

1    831
2    569
3    215
4     51
5     11
6      3
Name: num of genres, dtype: int64

In [46]:
genre_movie[genre_movie['num of genres']>1]

      movie id         movie title  num of genres
0            1          Toy Story               3
1            2          GoldenEye               3
3            4         Get Shorty               3
4            5            Copycat               3
6            7     Twelve Monkeys               2
...        ...                 ...            ...
1666      1669  MURDER and murder               3
1667      1670            Tainted               2
1670      1673             Mirage               2
1676      1679          B. Monkey               2
1677      1680      Sliding Doors               2

[849 rows x 3 columns]

**Observations**
1. The highest amount of genres one movie could have associated with is six.
2. The lowest amount of genres one movie could have associated with is one. 
3. The amount of genres that have the most amount of movies is one.
4. The amount of genres that have the least amount of movies is six.

## Conclusion
List 15 insights out of this datasets processing.
1. The dataset with the most amount of columns is the movie dataset. 
2. The dataset with the least amount of columns is the ratings dataset.
3. The dataset with the most amount of values is the ratings dataset.
4. The dataset with the least amount of values is the user dataset.
5. There are no missing values in any of the three datasets.
6. Drama has the most amount of movies associated with it.
7. Fantasy has the least amount of movies associated with it. 
8. The highest amount of genres a movie could be assocaited with was six. 
9. The highest rating was five and the lowest was one.
10. The average rating was 3.53 .
11. The median rating was four. 
12. The median age was 31.
13. The average age was 34.
14. The youngest age was seven.
15. The oldest age was 73.

### End of Lab 08.